{
    "name": "محمد پوربهزاد",
    "title": "برنامه نویس Full-stack",
    "age": "متولد ۱۳۸۱ (۲۳ سال)",
    "experience": "۷ سال سابقه کار تخصصی",
    "mobile": "۰۹۱۵۸۹۵۵۰۳۰",
    "location": "خراسان رضوی - مشهد",
    "about": {
        "title": "درباره من",
        "texts": [
            "برنامه نویس Full-stack با بیش از ۷ سال سابقه کار تخصصی برنامه نویسی و همکاری در بیش از ۲۰ پروژه تجاری و شرکتی.",
            "توسعه دهنده وب با تجربه و مهارت در تمام مراحل توسعه پیشرفته وب.",
            "دارای مجموعه‌ای متنوع از مهارت‌های برنامه نویسی در زمینه Back-end و Front-end با توانایی انجام پروژه به صورت تکی و همکاری گروهی."
        ]
    },
    "skills": "مهارت ها",
    "softSkills": {
        "title": "ویژگی های فردی",
        "items": [
            "کار تیمی",
            "خلاقیت",
            "نظم و دقت",
            "یادگیری"
        ]
    },
    "education": {
        "title": "سوابق تحصیلی",
        "description": "کارشناسی مهندسی کامپیوتر",
        "university": "دانشگاه آزاد اسلامی (۱۳۹۹ - ۱۴۰۳)",
        "gpa": "معدل: ۱۸.۸۲"
    },
    "experiences": {
        "title": "تجربه های کاری",
        "items": [
            {
                "title": "برنامه نویس Full-stack",
                "organ": "گروه برنامه نویسی اوریوتِک (مشهد)",
                "description": "طراحی و پیاده سازی قسمت Front-end و Back-end انواع وبسایت های فروشگاهی، شخصی، آموزشگاهی، سازمانی و...",
                "date": "تیر ۱۴۰۱ تا تیر ۱۴۰۳"
            },
            {
                "title": "تدریس در دانشگاه",
                "organ": "دانشگاه آزاد اسلامی (مشهد)",
                "description": "برگزاری کلاس های درس نظریه زبان ها و ماشین ها مقطع کارشناسی زیر نظر دکتر حلمی در نیمسال دوم سال تحصیلی ۱۴۰۲-۱۴۰۱ دانشگاه آزاد اسلامی مشهد.",
                "date": "دی ۱۴۰۱ تا تیر ۱۴۰۲",
                "certificate": "file/mohammad-pourbehzad.pdf"
            },
            {
                "title": "توسعه دهنده وب",
                "organ": "توسعه فناوری های بینش پویان آویژگان (مشهد)",
                "description": "طراحی و پیاده سازی قسمت Front-end و Back-end انواع وبسایت های فروشگاهی، شخصی، آموزشگاهی، سازمانی و...",
                "date": "تیر ۱۳۹۷ تا خرداد ۱۴۰۱"
            }
        ]
    },
    "projects": {
        "title": "پروژه ها",
        "linkTitle": "لینک",
        "showTitle": "مشاهده",
        "items": [
            {
                "title": "پکیج لیست استان‌ها و شهرها",
                "link": "https://github.com/mohammad-prb/provinces-and-cities",
                "texts": [
                    "آماده‌سازی لیست استان‌ها و شهرهای کشورها (درحال حاضر ایران و آلمان) بصورت JSON و MySQL برای استفاده در پروژه‌های مختلف و قرارگیری در دیتابیس.",
                    "همچنین پیاده‌سازی و انتشار پکیج رسمی این لیست‌ها برای JavaScript و Python و PHP در جهت استفاده راحت تر از این اطلاعات.",
                    "تاکنون این پروژه و پکیج‌های آن در مجموع بیش از ۷۰ استار در گیت‌هاب دریافت کرده‌اند."
                ],
                "examples": [
                    {
                        "title": "پکیج JavaScript",
                        "link": "https://github.com/mohammad-prb/provinces-and-cities-npm",
                        "description": "نصب به وسیله npm"
                    },
                    {
                        "title": "پکیج Python",
                        "link": "https://github.com/mohammad-prb/provinces-and-cities-pypi",
                        "description": "نصب به وسیله pip"
                    },
                    {
                        "title": "پکیج PHP",
                        "link": "https://github.com/mohammad-prb/provinces-and-cities-composer",
                        "description": "نصب به وسیله composer"
                    }
                ]
            },
            {
                "title": "پکیج js-flash برای npm",
                "link": "https://github.com/mohammad-prb/js-flash",
                "texts": [
                    "پیاده‌سازی پکیج رسمی js-flash برای نمایش پیام‌های فلش (Flash messege) مشابه toast و sonner در پروژه های جاواسکریپت.",
                    "این پکیج امکان استفاده در فریم‌ورک‌های جاواسکریپت مانند Vue، React، Angular و... را دارد. علاوه بر این امکان استفاده در پروژه‌های جاواسکریپت Pure هم وجود دارد.",
                    "این پکیج با استفاده از تایپ‌اسکریپت نوشته شده تا کارایی بهتری داشته باشد. تمام داکیومنت این پکیج به همراه راهنمای استفاده و... در صفحه گیت‌هاب پروژه (لینک پروژه) قابل مشاهده است."
                ]
            },
            {
                "title": "پیاده سازی وبسایت های تبلیغاتی و سازمانی",
                "texts": [
                    "پیاده سازی وبسایت های تبلیغاتی و سازمانی که باعث گسترش فعالیت‌های آنلاین، گسترش تبلیغات و ارتقاء خدمات آن مراکز و سازمان ها شده است.",
                    "همچنین همکاری با سازمان های جدید و پیشرفت های قابل توجه را برای آنها فراهم کرده است. برخی نمونه کارها:"
                ],
                "examples": [
                    {
                        "title": "پوشش مبل مشهد",
                        "link": "https://www.poosheshmobl.ir",
                        "description": "پوشش مبل مشهد، کارگاه تولیدی و دوزندگی انواع کاورهای مبل و... بصورت پارچه ای و طلقی در مشهد با بیش از نیم قرن تجربه و فعالیت حرفه ای در این زمینه است."
                    },
                    {
                        "title": "آموزشگاه طلاسازی زرسنج",
                        "link": "https://www.faridakhondi.ir",
                        "description": "آموزشگاه فنی و حرفه‌ای آزاد طلا و جواهرسازی زرسنج مهر خراسان مجهز به آزمایشگاه عیارسنجی طلا ۱۷۰۲۵ با ورژن ۲۰۱۷ از مرکز ملی تایید صلاحیت ایران. دارای گواهی ایزو 9001:2015 انگلستان و..."
                    },
                    {
                        "title": "بنیاد علمی فرهنگی ولایت",
                        "link": "https://www.vlth.ir",
                        "description": "بنیاد علمی فرهنگی ولایت با هدف تربیت نیروی انسانی متعهد، توسعه اقتصادی، ارائه خدمات اجتماعی و فرهنگی و گسترش فعالیت‌های بین‌المللی فعالیت‌های متعددی انجام می‌دهد."
                    },
                    {
                        "title": "بنیاد حفظ آثار و نشر ارزش های دفاع مقدس",
                        "link": "https://www.narkh.ir",
                        "description": "اداره کل حفظ آثار و نشر ارزش های دفاع مقدس خراسان رضوی به موجب فرمان مقام معظم فرماندهی کل قوا و شرح وظایف ستاد کل نیروهای مسلح در سال ۱۳۶۹ تاسیس شده و درجهت ارزش های دفاع مقدس فعالیت می کند."
                    },
                    {
                        "title": "مجمع اسلامی حبل‌الله",
                        "link": "https://www.mihm.ir",
                        "description": "مجمع اسلامی حبل‌الله مشهد، یک تشکل مردمی است که در اواخر سال ۱۳۹۲ آغاز به فعالیت کرده است و فعالیت های خود را حول محور همگرایی امت اسلامی انجام می دهد."
                    }
                ]
            },
            {
                "title": "پیاده سازی فروشگاه های اینترنتی",
                "texts": [
                    "پیاده سازی وبسایت های فروشگاهی که باعث گسترش فروش و فعالیت‌های آنلاین، افزایش تنوع محصولات و ارتقاء خدمات به مشتریان آن فروشگاه شده است.",
                    "همچنین همکاری با برندهای جدید و برجسته را برای آنها فراهم کرده است. برخی نمونه کارها:"
                ],
                "examples": [
                    {
                        "title": "طلا فروشی گلن",
                        "link": "https://glengold.org",
                        "description": "فروشگاه گلن با بیش از ۱۶ سال سابقه، طراح، تولید کننده و عرضه‌کننده انواع مصنوعات طلا به سبکی جذاب و متفاوت است."
                    },
                    {
                        "title": "فروشگاه رایحه مان",
                        "link": "https://rayehemanshop.ir",
                        "description": "فروشگاه رایحه مان توليد كننده و فروشنده انواع عطر و روغن های طبیعی، خاص و درمانی ميباشد."
                    },
                    {
                        "title": "هنرکده دیجیتال ولیعصر",
                        "link": "https://honardouz.ir",
                        "description": "هنرکده دیجیتال ولیعصر توليد كننده انواع تابلوهای گلدوزی شده مثل تابلوهای آویز، اسماء، قرآنی و... می‌باشد."
                    },
                    {
                        "title": "فروشگاه دی کالا",
                        "link": "https://dikala.ir",
                        "description": "فروشگاه دی کالا عرضه کننده انواع محصولات دیجیتال با کیفیت از جمله انواع گوشی موبایل، ساعت هوشمند، کنسول بازی، هندز فری، ایرپاد، هدست، پرینتر و لوازم جانبی می باشد."
                    },
                    {
                        "title": "فروشگاه چشم برتر",
                        "link": "https://cheshmbartar.ir",
                        "description": "شركت چشم برتر توليد كننده انواع کالای دیجیتال، دوربین های مداربسته، دزدگیر، تجهیزات شبکه، درب های اتومات، تجهیزات ردیابی و... می‌باشد."
                    },
                    {
                        "title": "فروشگاه ترمه ساهور",
                        "link": "https://sahour.ir",
                        "description": "فروشگاه ترمه ساهور توليد كننده و فروشنده انواع ترمه، جانماز، سجاده، رومیزی، مخمل و... ميباشد."
                    }
                ]
            },
            {
                "title": "جمع آوری کننده اخبار",
                "link": "https://github.com/mohammad-prb/news-collector",
                "texts": [
                    "این پروژه اخبار اخیر را در وبسایت های خبری درمورد یک کلمه کلیدی جمع آوری می کند و این اخبار جمع آوری شده را به پایگاه داده اضافه می کند. این اخبار می توانند در هرکجای وبسایت شما نمایش داده شوند تا باعث بروز نگه داشته شدن محتوای سایت شما برای کاربران و موتوهای جستجو شوند.",
                    "این پروژه در Cronjob سرور قرار میگیرد تا بطور مداوم و این اخبار را جمع آوری کند. این پروژه با توجه به بروز نگه داشتن سایت و قرار دادن محتوای مرتبط با جستجوی کاربران در وبسایت، برای بهبود سئو وبسایت بسیار مفید است و بازدید وبسایت را به شکل قابل توجهی افزایش می دهد و وبسایت را برای موتورهای جستجو بهینه می کند."
                ]
            },
            {
                "title": "وب اپلیکیشن مدیریت اسناد",
                "link": "https://github.com/mohammad-prb/document-management",
                "texts": [
                    "این برنامه برای مدیریت اسناد در یک سازمان استفاده می شود. در این برنامه، افراد خود را وارد کرده و سطح دسترسی هر یک را تعیین می کنید. سپس می توانید اسناد را برای هر یک از سطوح دسترسی آپلود کنید. پس از ورود به برنامه، هر فرد تنها می تواند مدارکی را که باید مشاهده کند.",
                    "این وب اپلیکیشن برای کنترل دسترسی کارکنان سازمان استفاده می شود، همچنین می توان با کمک این برنامه اسناد سازمان را دسته بندی کرد تا دسترسی به این اسناد راحت شده و از شلوغی اسناد جلوگیری شود. همچنین تاریخ و ساعت بارگذاری هر فایل مشخص شده و ترتیب آنها مشخص است. در هر لحظه می توان به ورژن های قبلی این فایل ها هم دسترسی داشت."
                ]
            },
            {
                "title": "وب اپلیکیشن حضورغیاب کارمندان",
                "texts": [
                    "در این برنامه زمان شروع و پایان کار هر روز را برای افراد خود وارد می کنید. این برنامه میزان کار هر فرد را در روز، هفته، ماه و سال محاسبه می کند. همچنین آمارهای مختلفی از زمان کار هر فرد را در بازه های زمانی مختلف ارائه میدهد.",
                    "این اپلیکیشن همچنین حقوق هر فرد را بر اساس زمان کار انجام شده محاسبه می کند. در این برنامه شما تاریخچه ساعات کاری و حقوق های محاسبه شده برای کارمندان خود را دارید."
                ]
            }
        ]
    },
    "source": "سورس کد این رزومه"
}
